---
title: AdvancedOpaque
classe: Autodesk.Revit.DB.Visual.AdvancedOpaque
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 15
---

# AdvancedOpaque

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String OpaqueAlbedo { get; }` | `AdvancedOpaque.OpaqueAlbedo` | String |
| `String OpaqueEmission { get; }` | `AdvancedOpaque.OpaqueEmission` | String |
| `String OpaqueF0 { get; }` | `AdvancedOpaque.OpaqueF0` | String |
| `String OpaqueLuminance { get; }` | `AdvancedOpaque.OpaqueLuminance` | String |
| `String OpaqueLuminanceModifier { get; }` | `AdvancedOpaque.OpaqueLuminanceModifier` | String |
| `String OpaqueMfp { get; }` | `AdvancedOpaque.OpaqueMfp` | String |
| `String OpaqueMfpModifier { get; }` | `AdvancedOpaque.OpaqueMfpModifier` | String |
| `String OpaqueTranslucency { get; }` | `AdvancedOpaque.OpaqueTranslucency` | String |
| `String SurfaceAlbedo { get; }` | `AdvancedOpaque.SurfaceAlbedo` | String |
| `String SurfaceAnisotropy { get; }` | `AdvancedOpaque.SurfaceAnisotropy` | String |
| `String SurfaceCutout { get; }` | `AdvancedOpaque.SurfaceCutout` | String |
| `String SurfaceNdfType { get; }` | `AdvancedOpaque.SurfaceNdfType` | String |
| `String SurfaceNormal { get; }` | `AdvancedOpaque.SurfaceNormal` | String |
| `String SurfaceRotation { get; }` | `AdvancedOpaque.SurfaceRotation` | String |
| `String SurfaceRoughness { get; }` | `AdvancedOpaque.SurfaceRoughness` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```